Revit 2027 API
ParameterTypeId.TrussElementRotateChordsWithTruss Property
 "Rotate Chords With Truss"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TrussElementRotateChordsWithTruss { get; }
Public Shared ReadOnly Property TrussElementRotateChordsWithTruss As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TrussElementRotateChordsWithTruss {
	ForgeTypeId^ get ();
}
static member TrussElementRotateChordsWithTruss : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace